---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AutoPanelWall
source: html/08860f43-84b7-78f6-1792-c0ebb2aaf829.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AutoPanelWall Property

"Curtain Panel"

## Syntax (C#)
```csharp
public static ForgeTypeId AutoPanelWall { get; }
```